Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Navigates to the next screen
ja: 次の画面に移動します

source: Navigates to your profile
ja: あなたのプロフィールに移動します

source: Need to report a copyright violation, legal request, or regulatory compliance issue?
ja: 著作権侵害、法的要求、または規制遵守の問題を報告する必要がありますか？

source: Network takedowns which filter the content from the APIs
ja: APIからコンテンツをフィルタリングする公開停止措置（takedown）

source: Nevermind, create a handle for me
ja: 気にせずにハンドルを作成

source: New
ja: 新規

source: New Feature
ja: 新機能

source: New Post
ja: 新しい投稿

source: New chat
ja: 新しいチャット

source: New email address
ja: 新しいメールアドレス

source: New follower notifications
ja: 新しいフォロワーの通知

source: New followers
ja: 新しいフォロワー

source: New handle
ja: 新しいハンドル

source: New list
ja: 新しいリスト

source: New messages
ja: 新しいメッセージ

source: New password
ja: 新しいパスワード

source: New post
ja: 新しい投稿

source: New posts from {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0>
ja: {firstAuthorLink}および<0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0>からの新しい投稿

source: New posts from {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}
ja: {firstAuthorName}および{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}からの新しい投稿

source: New starter pack
ja: スターターパックを作成する

source: New user info dialog
ja: 新しいユーザー情報ダイアログ

source: New {postsCount, plural, one {post} other {posts}} from {firstAuthorLink}
ja: {firstAuthorLink}からの新しい{postsCount, plural, other {投稿}}

source: New {postsCount, plural, one {post} other {posts}} from {firstAuthorName}
ja: {firstAuthorName}からの新しい{postsCount, plural, other {投稿}}

source: Newest replies first
ja: 新しい順に返信を表示

source: News
ja: ニュース

source: Next
ja: 次へ

source: Next image
ja: 次の画像

source: Next we query the PLC directory for the DID, so that we can learn the hosting service's endpoint and the user's key material.
ja: 次に、返されたDIDでPLCディレクトリに問い合わせ、ホスティングサービスのエンドポイントとユーザーの鍵マテリアルを確認します。

source: Next, add a function that posts. This will instantiate a new `Client` using the authenticated session, and use it to create a post. The `app.bsky.feed.post` Lexicon requires two parameters: the text of a post — you'll use "🙂" — and a timestamp.
ja: 次に、投稿する関数を追加します。認証済みセッションを使って新しい`Client`を生成し、投稿を作成します。`app.bsky.feed.post` Lexiconには2つのパラメータが必要です。投稿本文（ここでは"🙂"）とタイムスタンプです。

source: Next, add the `oauth-client-node` package from the Atproto ecosystem, which provides OAuth client functionality.
ja: 次に、OAuthクライアント機能を提供するatprotoエコシステムの`oauth-client-node`パッケージを追加します。

source: Next, add the migrations script that creates these tables. If you're building on top of the OAuth tutorial and have already deployed/migrated your database, you'll want to put these in a new migration, e.g. called "002", in `lib/db/migrations.ts`:
ja: 次に、これらのテーブルを作成する移行スクリプトを追加します。OAuthチュートリアルを土台にしていて、すでにデータベースをデプロイ/移行済みの場合は、`lib/db/migrations.ts`に新しいmigration（"002"など）として追加してください。

source: Next, consider a more complex integration, that requests additional permissions. By default, these will be presented in a summarized view:
ja: 次に、追加の権限を要求する、より複雑な連携を考えます。デフォルトでは、これらは要約で提示されます。

source: Next, create `lib/auth/session.ts` to manage user sessions:
ja: 次に、ユーザーセッションを管理する`lib/auth/session.ts`を作成します。

source: Next, create `lib/db/queries.ts` with some database queries for handling Tap events:
ja: 次に、Tapイベント処理用のデータベースクエリを`lib/db/queries.ts`に作成します。

source: Next, create `scripts/migrate.ts` so the migrations can be run from the command line:
ja: 次に、コマンドラインからマイグレーションを実行できるよう`scripts/migrate.ts`を作成します。

source: Next, create a Status picker component at `components/StatusPicker.tsx`:
ja: 次に、`components/StatusPicker.tsx`にステータス選択コンポーネントを作成します。

source: Next, create the "migrations" that you'll run to populate the database schema. Create `lib/db/migrations.ts`:
ja: 次に、データベーススキーマを作成するための"migrations"を作ります。`lib/db/migrations.ts`を作成してください。

source: Next, navigate to a post you wish to report, and select "Report Post":
ja: 次に、報告したい投稿に移動し、「投稿を報告（Report Post）」を選択します。

source: Next, replace the contents of `next.config.ts` to use `better-sqlite3` server-side:
ja: 次に、`next.config.ts`の内容を置き換えてサーバー側で`better-sqlite3`を使うようにします。

source: Next, update `app/page.tsx` to display the full feed with top statuses, handles, and timestamps:
ja: 次に `app/page.tsx`を更新し、上位ステータス、ハンドル、タイムスタンプを含む完全なフィードを表示します。

source: Next, update `lib/auth/client.ts` once more to use the confidential client configuration when in production:
ja: 次に、`lib/auth/client.ts`をもう一度更新し、本番時に機密クライアント設定を使うようにします。

source: Next, you might try [writing](/guides/writing-data) to a user's data repository.
ja: 次は、ユーザーのデータリポジトリに[書き込み](/guides/writing-data)を試してみるとよいでしょう。

source: Next, you should also create a logout route at `app/oauth/logout/route.ts` to clear the user's session:
ja: 次に、ユーザーセッションをクリアするため`app/oauth/logout/route.ts`にログアウトルートも作成します。

source: Next, you'll add sync features to actually receive status updates.
ja: 次に、実際にステータス更新を受け取るための同期機能を追加します。

source: Next, you'll be prompted to update your account registration with the [PLC](https://web.plc.directory/), to mark this account as a moderation service. This will trigger an email verification. Verify that you are using the correct account and domain name, and then provide the verification code:
ja: 次に、このアカウントをモデレーションサービスとしてマークするために、[PLC](https://web.plc.directory/)上のアカウント情報更新を要求します。この時、電子メールの確認がトリガーされます。正しいアカウントとドメイン名を使用していることを確認し、確認コードを入力します。

source: Next, you'll implement baseline OAuth functionality.
ja: 次に、基本となるOAuth機能を実装します。

source: Next, you'll set up the logic to consume posts from the firehose.
ja: 次に、firehoseから投稿を取り込むロジックを設定します。

source: No DNS Panel
ja: DNSパネルがない場合

source: No ads, no invasive tracking, no engagement traps. Bluesky respects your time and attention.
ja: 広告ゼロ。しつこい追跡なし。使い続けさせるために手放せなくする罠、エンゲージメントトラップもなし。Blueskyは、あなたの時間と集中を大切にします。

source: No app passwords yet
ja: アプリパスワードはまだありません

source: No contacts found
ja: 連絡先が見つかりません

source: No contacts with the name “{query}” found
ja: 「{query}」という名前の連絡先が見つかりません

source: No expiry set
ja: 終了時間未定

source: No featured GIFs found. There may be an issue with Tenor.
ja: おすすめのGIFが見つかりません。Tenorに問題があるかもしれません。

source: No feeds found. Try searching for something else.
ja: フィードが見つかりませんでした。他を探してみて。

source: No followers yet
ja: まだフォロワーがいません

source: No image
ja: 画像なし

source: No likes yet
ja: いいねはありません

source: No longer following {0}
ja: {0}のフォローを解除しました

source: No media yet
ja: まだメディアがありません

source: No messages yet
ja: メッセージはありません

source: No more doomscrolling junk-filled algorithms. Find feeds that work for you, not against you.
ja: 延々と流れてくる嫌なものから目が離せなくなるドゥームスクロールを生むノイズまみれのアルゴリズムは、もういらない。あなたの味方をするフィードを見つけよう。

source: No name
ja: 名前なし

source: No notifications yet!
ja: お知らせはありません！

source: No one
ja: 誰も

source: No one but the author can quote this post.
ja: 投稿者だけがこの投稿を引用できます。

source: No posts here
ja: ここに投稿はありません

source: No posts yet
ja: まだ投稿がありません

source: No quotes yet
ja: まだ引用がありません

source: No replies yet
ja: まだ返信がありません

source: No reposts yet
ja: まだリポストがありません

source: No result
ja: 結果はありません

source: No results
ja: 結果はありません

source: No results for "{0}".
ja: 「{0}」に該当するものは見つかりませんでした。

source: No results found
ja: 結果は見つかりません

source: No results found for "<0>{query}</0>".
ja: 「<0>{query}</0>」の検索結果はありません。

source: No results found for "{query}"
ja: 「{query}」の検索結果はありません

source: No results.
ja: 見つかりませんでした。

source: No search results found for "{search}".
ja: 「{search}」の検索結果はありません。

source: No thanks
ja: 結構です

source: No video posts yet
ja: まだビデオの投稿がありません

source: No. The AT Protocol is a [federated protocol](https://en.wikipedia.org/wiki/Federation_(information_technology)). It's not a blockchain nor does it use a blockchain.
ja: いいえ。ATプロトコルは[フェデレーションプロトコル](https://en.wikipedia.org/wiki/Federation_(information_technology))です。ブロックチェーンではありませんし、ブロックチェーンを使用していません。

source: Nobody
ja: 返信不可

source: Nobody has liked this yet. Maybe you should be the first!
ja: まだ誰もこれをいいねしていません。あなたが最初になるべきかもしれません！

source: Nobody has quoted this yet. Maybe you should be the first!
ja: まだ誰もこれを引用していません。あなたが最初になるべきかもしれません！

source: Nobody has reposted this yet. Maybe you should be the first!
ja: まだ誰もこれをリポストしていません。あなたが最初になるべきかもしれません！

source: Nobody was found. Try searching for someone else.
ja: 誰も見つかりませんでした。他を探してみて。

source: Nobody's perfect 😊
ja: 誰しも完璧ではありません😊

source: Non-consensual intimate imagery
ja: 同意のない親密画像（NCII）

source: Non-sexual Nudity
ja: 性的ではないヌード

source: None
ja: なし

source: Not Found
ja: 見つかりません

source: Not available on this platform.
ja: このプラットフォームでは利用できません。

source: Not followed by anyone you're following
ja: フォローしている人は誰にもフォローしていません

source: Note about sharing
ja: 共有についての注意事項

source: Note that event stream (firehose) "frames" may consist of multiple records, and larger limits are recommended for CBOR parsing in general, on the order of 4-5 MBytes.
ja: イベントストリーム（firehose）の"フレーム"は複数のレコードで構成される可能性があり、一般的なCBOR解析には4～5MBytes程度のより大きな制限が推奨されます。

source: Note the `auth` prefix in the `app.example.feed.authOnlyPost` and `com.example.authBasicFeatures` examples. This is a naming convention to indicate that the Lexicon is designed for use as a permission set.
ja: `app.example.feed.authOnlyPost`や`com.example.authBasicFeatures`の例にある`auth`プレフィックスに注目してください。これは、そのLexiconが権限セットとして使われるよう設計されていることを示す命名規則です。

source: Note: Bluesky is an open and public network. This setting only limits the visibility of your content on the Bluesky app and website, and other apps may not respect this setting. Your content may still be shown to logged-out users by other apps and websites.
ja: 注記：Blueskyはオープンでパブリックなネットワークです。この設定はBlueskyのアプリおよびウェブサイト上のみでのあなたのコンテンツの可視性を制限するものであり、他のアプリではこの設定を尊重しない場合があります。他のアプリやウェブサイトでは、ログアウトしたユーザーにあなたのコンテンツが表示される場合があります。

source: Note: This post is only visible to logged-in users.
ja: 注：この投稿はログイン中のユーザーにのみ表示されます。

source: Nothing here
ja: 何もありません

source: Nothing saved yet
ja: まだ何も保存されていません

source: Notification Sounds
ja: 通知音

source: Notification settings
ja: 通知設定

source: Notification sounds
ja: 通知音

source: Notifications
ja: 通知

source: Notifications for everything else, such as when someone joins via one of your starter packs.
ja: 誰かがあなたのスターターパックを経由して参加した等、その他のすべての通知。

source: Now
ja: 今

source: Now in our homepage we can list out the status buttons:
ja: これで、ホームページにステータスボタンを一覧表示できます。

source: Now let's run some code-generation using our schema:
ja: では、スキーマを使用してコード生成を実行してみましょう。

source: Now logged-in users will see "Signed in as @theirhandle" instead of just "Signed in", along with a feed of recent statuses from all users, and a "Top Statuses" section showing the most popular current statuses.
ja: これでログイン中ユーザーには単なる"Signed in"ではなく"Signed in as @theirhandle"が表示され、全ユーザーの最新ステータスフィードと、人気の現在ステータスを示す"Top Statuses"セクションも表示されます。

source: Now that we have statuses populating our SQLite, we can produce a timeline of status updates by users. We also use a [DID](https://atproto.com/specs/did)-to-handle resolver so we can show a nice username with the statuses:
ja: SQLiteにステータスが取り込まれたので、ユーザーによるステータス更新のタイムラインを作成できます。また、[DID](https://atproto.com/specs/did)からハンドルへのリゾルバも使用して、ステータスとともに適切なユーザー名を表示できるようにします。

source: Now that we've set up our high-scale decentralized backend, let's map out how an application actually works on ATProto.
ja: 大規模な分散型バックエンドをセットアップしたので、ATプロトコルでアプリケーションが実際にどのように動作するかを図にしてみましょう。

source: Now that your feed server is running, you can customize it further, then publish it for others to use. To do that, you'll want to deploy it to a public server (e.g., AWS, DigitalOcean, etc.) and ensure it's accessible over HTTPS.
ja: フィードサーバーが動作したので、さらにカスタマイズして他の人が使えるように公開できます。そのためには、公開サーバー（例：AWS、DigitalOceanなど）へデプロイし、HTTPSでアクセス可能にしてください。

source: Now we can write these statuses into our database as they arrive from the firehose:
ja: これで、firehoseから到着したステータスをデータベースに書き込むことができます。

source: Now we notice that keeping our view servers synced with the canonical data in the NoSQL cluster is tricky. Sometimes our view servers crash and miss updates. We need to make sure that our views stay reliably up-to-date.
ja: ここで、ビューサーバーをNoSQLクラスター内の正規データと同期させ続けるのは難しいことに気が付きました。ビューサーバーがクラッシュして更新が失われることがあります。ビューが確実に最新の状態に保たれるようにする必要があります。

source: Now we want to fetch the status records from other users.
ja: 次に、他のユーザーからステータスレコードを取得します。

source: Now we're going to opinionate our NoSQL services so they all use this [data repository](/guides/data-repos) model.
ja: 次に、NoSQLサービスに意見を表明して、すべてのサービスがこの[データリポジトリ](/guides/data-repos)モデルを使用するようにします。

source: Now you can move on to creating the database schema.
ja: これでデータベーススキーマの作成に進めます。

source: Now you can replace everything after the `login` function in your script with new logic that uses the AI SDK to generate replies:
ja: これで、スクリプト内の`login`関数以降を、AI SDKを使ってリプライを生成する新しいロジックに置き換えられます。

source: Now you can start building your feed generator.
ja: これでフィードジェネレーターの構築を始められます。

source: Now you can test the bot using `ts-node`.
ja: これで`ts-node`を使ってボットをテストできます。

source: Now you just need to add a few forms. Create `components/LoginForm.tsx`:
ja: あとはフォームをいくつか追加するだけです。`components/LoginForm.tsx`を作成します。

source: Now your Ozone instance is set up and ready to use!
ja: これで、あなたのOzoneインスタンスの設定が完了し、利用する準備ができました。

source: Now, create a new Typescript project directory and initialize your project:
ja: 次に、新しいTypeScriptプロジェクトディレクトリを作成し、プロジェクトを初期化します。

source: Now, in another terminal, install and run `tap` from its source repository:
ja: 次に別ターミナルで、ソースリポジトリから`tap`をインストールして実行します。

source: Now, return to the Ozone interface. You should see the new report listed in the *Reports* section:
ja: ここで、Ozoneインターフェースに戻ります。新しい報告が*Reports*セクションに列挙されているはずです。

source: Now, you'll add [XRPC](/guides/lexicon#http-api-methods) routes to serve our feed. Your server will be handling two kinds of requests:
ja: 次に、フィードを配信するための[XRPC](/guides/lexicon#http-api-methods)ルートを追加します。サーバーは次の2種類のリクエストを扱います。

source: Now, you'll create and action an example moderation report. In Bluesky or another application, sign back in to a regular (non-labeler) account. Then, navigate to the account page for your labeler service.
ja: 次に、モデレーション報告をの例を作成して処理します。Blueskyまたは別のアプリケーションで、通常の（ラベラーではない）アカウントにサインインし直します。次に、ラベラーサービスのアカウントページに移動します。

source: Nudity
ja: ヌード

source: Number should be a mobile number
ja: 電話番号は携帯の電話番号でなければなりません

source: OAuth aims to solve these problems with a family of open specifications for managing secure authorization without requiring a person's username and password. If you've ever used a "Sign in with..." button or link on the web, you've used OAuth.
ja: OAuthはこれらの問題を、個人のユーザー名とパスワードを必要とせずに安全な認可を管理するオープン仕様群によって解決することを目指しています。ウェブ上で「…でサインイン」ボタンやリンクを使用したことがあれば、OAuthを使用したことがあるということです。

source: OAuth client software is identified by a globally unique `client_id`. Distinct variants of client software may have distinct `client_id` values; for example the browser app and Android (mobile OS) variants of the same software might have different `client_id` values. The `client_id` must be a fully-qualified web URL from which the client-metadata JSON document can be fetched. For example, `https://app.example.com/oauth-client-metadata.json`. Some more about the `client_id`:
ja: OAuthクライアントソフトウェアはグローバルに一意な`client_id`で識別されます。クライアントソフトウェアの各バリアントは異なる`client_id`を持つことがあります。例えば同じソフトウェアのブラウザ版とAndroid（モバイル）版は異なる`client_id`を持つかもしれません。`client_id`は、クライアントメタデータJSONドキュメントが取得できる完全修飾のウェブURLでなければなりません。例えば`https://app.example.com/oauth-client-metadata.json`のようなものです。`client_id`に関する追加情報：

source: OAuth in AT uses [Pushed Authorization Requests](https://auth0.com/blog/what-are-oauth-push-authorization-requests-par/) (PAR). The client metadata file will be fetched dynamically during the session lifecycle, and the `scope` parameter in `oauth-client-metadata.json` *needs to match* the actual authorization HTTP request made by your app:
ja: ATにおけるOAuthは[Pushed Authorization Requests](https://auth0.com/blog/what-are-oauth-push-authorization-requests-par/)（PAR）を使用します。クライアントメタデータファイルはセッションライフサイクル中に動的に取得され、`oauth-client-metadata.json`の`scope`パラメーターはアプリが実際に行う認可HTTPリクエストと*一致している必要があります*。

source: OAuth is an authorization framework that lets developers request access to an account without requiring users to hand over their password. Without OAuth, if someone wanted to authorize a 3rd party app to access their account, their only option would be to type their username and password into that app. This is bad for all sorts of reasons, the first being that a 3rd party app gets to see, and likely save, passwords. And once an app has a username and password, the app would have _full_ access to their account.
ja: OAuthは、ユーザーがパスワードを渡すことなく、開発者がアカウントへのアクセスをリクエストできるようにする認可フレームワークです。OAuthがなければ、サードパーティアプリケーションにアカウントへのアクセスを許可したい場合、ユーザー名とパスワードをそのアプリケーションに入力するしかありません。これはさまざまな理由で問題があり、一番の理由はサードパーティアプリケーションがパスワードを見て、ともすれば保存してしまうという点です。アプリケーションがユーザー名とパスワードを持つと、アプリケーションはアカウントへの*完全な*アクセスを持つことになります。

source: OAuth loopback works by using a special redirect URI (like http://127.0.0.1:PORT/callback) to send authorization codes directly back to an app, which listens on a local port, avoiding browser-based callbacks and enabling secure, direct communication for token exchange. Instead of a web redirect, the app opens a local listener, you can auth in a browser, and the server redirects back to the app's local URI, letting the app grab the code and exchange it for a token. It's particularly useful for development scenarios.
ja: OAuthのループバックは、特別なリダイレクトURI（例：[http://127.0.0.1:PORT/callback](http://127.0.0.1:PORT/callback)）を使って認可コードをアプリへ直接返します。アプリはローカルポートで待ち受けるため、ブラウザベースのコールバックを避けつつ安全にトークン交換できます。ウェブへのリダイレクトの代わりに、アプリがローカルリスナーを開き、ブラウザで認証したあとサーバーがアプリのローカルURIに戻すことで、アプリがコードを受け取ってトークンに交換します。特に開発時に有用です。

source: OTA status: ...
ja: OTA ステータス：…

source: OTA status: Available!
ja: OTAステータス：利用可能！

source: OTA status: Error fetching update
ja: OTA ステータス：更新の取得に失敗しました

source: OTA status: None available
ja: OTA ステータス：利用可能なものはありません

source: Of course the abstraction doesn't always work perfectly, and this new topology brought with it a host of problems - most notably data availability and discovery. As noted earlier, if the poster of some data is not online, you need to find that data from another device in the network. Discovering which device can serve you some data is a hard problem, especially with devices routinely coming on and offline at different addresses. And it may be the case that there is not a single online device that can send you the data that you're looking for! Even if everything is functioning well, these systems have to lean in hard to eventual consistency since network partitions are much more common and there is no service in the network that can purport to have a “global view” of all data.
ja: もちろんこの抽象化が常に完璧に機能するわけではなく、この新しいトポロジーは多くの問題、特にデータの可用性と発見性の問題をもたらしました。前述の通り、あるデータの投稿者がオフラインなら、ネットワーク内の別のデバイスからそのデータを見つける必要があります。どのデバイスがそのデータを提供できるのかを見つけるのは難しい問題で、特にデバイスが異なるアドレスで頻繁にオンライン/オフラインを繰り返す場合はなおさらです。探しているデータを送れるオンラインデバイスが1台もないことすらあり得ます。すべてがうまく動いていても、ネットワーク分断がはるかに一般的で、ネットワーク内に全データのグローバルビューを持つと主張できるサービスがないため、これらのシステムは結果整合性に強く依存せざるを得ません。

source: Of these three, the BFF pattern is the currently recommended approach for building confidential-client applications. This is demonstrated in the [cookbook/go-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/go-oauth-web-app#readme) and [cookbook/python-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/python-oauth-web-app#readme) examples.
ja: この3つのうち、BFFパターンが機密クライアントアプリケーションを構築するための現在推奨されているアプローチです。これは[cookbook/go-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/go-oauth-web-app#readme)と[cookbook/python-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/python-oauth-web-app#readme)の例で示されています。

source: Off
ja: オフ

source: Oh no!
ja: ちょっと！

source: Okay
ja: OK

source: Oldest replies first
ja: 古い順に返信を表示

source: On a profile: affects only the profile record (e.g. user avatar) and never hides any content, including the account in listings.
ja: プロフィールに対して：プロフィールレコード（例：ユーザーアバター）にのみ影響し、一覧からアカウントを隠すことはありません。

source: On an account: has account-wide effects
ja: アカウントに対して：アカウント全体に影響があります。

source: On content: affects the content specifically (a post record, a list, a feed, etc.)
ja: コンテンツに対して：コンテンツ毎に固有の影響があります（投稿レコード、リスト、フィードなど）。

source: On platforms supported by [homebrew](https://brew.sh/), you can install it with:
ja: [homebrew](https://brew.sh/)に対応したプラットフォームでは、次のコマンドでインストールできます。

source: On platforms supported by [homebrew](https://brew.sh/), you can install them with:
ja: [homebrew](https://brew.sh/)に対応したプラットフォームでは、次のコマンドでインストールできます。

source: On platforms supported by [homebrew](https://brew.sh/), you can install these with:
ja: [homebrew](https://brew.sh/)に対応したプラットフォームでは、次のコマンドでインストールできます。

source: Onboarding reset
ja: オンボーディングのリセット

source: Once a Lexicon is published, it can never change its constraints. Loosening a constraint (adding possible values) will cause old software to fail validation for new data, and tightening a constraint (removing possible values) will cause new software to fail validation for old data. As a consequence, lexicons may only add optional constraints to previously unconstrained fields.
ja: Lexiconが発行されたら、その制約を変更することはできません。制約を緩和（取りうる値を追加）すると、古いソフトウェアが新しいデータの検証に失敗し、制約を厳しく（取りうる値を削減）すると、新しいソフトウェアが古いデータの検証に失敗します。その結果、Lexiconsはそれまで制約が無かったフィールドにはオプションの制約しか追加できません。

source: Once content has been migrated, the identity (DID and handle) can be updated to indicate that the new PDS is the current host for the account.
ja: コンテンツが移行されたら、ID（DIDとハンドル）を更新して、新しいPDSがそのアカウントの現行ホストであることを示すことができます。

source: Once you have a logged-in `agent`, you can create a `Client` instance to read and write data:
ja: ログインした`agent`が取得できたら、`Client`インスタンスを作成してデータの読み書きができます。

source: Once you've got an API key, add the AI SDK to your project:
ja: APIキーを取得したら、プロジェクトにAI SDKを追加します。

source: One last thing — remember, you only added a single data source to `tap` earlier. To see statuses from across the entire network, stop and re-run `tap` with the `--signal-collection` flag:
ja: 最後に、先ほど`tap`には単一データソースしか追加していません。ネットワーク全体のステータスを見るには、`--signal-collection`フラグ付きで`tap`を停止して再実行します。

source: One more thing you should do now is update the `SCOPE` constant in `lib/auth/client.ts` to request access to this collection. Atproto permission scopes are Lexicons, so you can add `xyz.statusphere.status` to the list of scopes your app requests:
ja: もう1つ、`lib/auth/client.ts`の`SCOPE`定数を更新してこのコレクションへのアクセスを要求してください。atproto の権限スコープはLexicon単位なので、アプリが要求するスコープに`xyz.statusphere.status`を追加します。

source: One of the core primitives of the AT Protocol is the *firehose*. It is an authenticated stream of events used to efficiently sync user updates (posts, likes, follows, handle changes, etc).
ja: ATプロトコルのコアプリミティブの一つは*firehose*です。これは、ユーザーの更新（投稿、いいね、フォロー、ハンドル変更など）を効率的に同期するために使用される署名付きイベントストリームです。

source: One of the most powerful ways to get social graph data from AT Protocol is through the use of **backlinks**. Querying backlinks lets you resolve all of the records linking *to* any given record, *or* identity.
ja: ATプロトコルからソーシャルグラフデータを取得する強力な方法として、**バックリンク**があります。バックリンクを取得すると、特定のレコード*や*ID*に*リンクしているすべてのレコードを解決できます。

source: One or more GIFs is missing alt text.
ja: 1つもしくは複数のGIFにALTテキストがありません。

source: One or more images is missing alt text.
ja: 1つもしくは複数の画像にALTテキストがありません。

source: One or more of your selected files are not supported.
ja: 選択したファイルの 1つ以上がサポートされていません。

source: One or more of your selected files are too large. Maximum size is 100 MB.
ja: 選択したファイルのうちの1つ以上が大きすぎます。最大で100MBです。

source: One or more videos is missing alt text.
ja: 1つもしくは複数のビデオにALTテキストがありません。
